In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
dataset = pd.read_csv('D:\DA DS\data cleaning datasets\cars_delhi.csv')

In [4]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date
0,2018 Tata NEXON,XM 1.2,Manual,"95,230 km",1st Owner,Petrol,UP-16,"₹6,50,000",31 December 2018
1,2017 Renault Kwid,1.0 RXT Opt,Manual,"72,956 km",2nd Owner,Petrol,HR-11,"₹3,19,000",05 March 2019

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 899 entries, 0 to 898
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_name       899 non-null    object
 1   variant        896 non-null    object
 2   transmission   893 non-null    object
 3   km_driven      897 non-null    object
 4   owner_type     899 non-null    object
 5   fuel_type      899 non-null    object
 6   registeration  898 non-null    object
 7   price          899 non-null    object
 8   Date           899 non-null    object
dtypes: object(9)
memory usage: 63.3+ KB

In [6]:
dataset.shape[0]

899

In [7]:
dataset.isnull().sum()

car_name         0
variant          3
transmission     6
km_driven        2
owner_type       0
fuel_type        0
registeration    1
price            0
Date             0
dtype: int64

In [8]:
(dataset.isnull().sum()/dataset.shape[0])*100

car_name         0.000000
variant          0.333704
transmission     0.667408
km_driven        0.222469
owner_type       0.000000
fuel_type        0.000000
registeration    0.111235
price            0.000000
Date             0.000000
dtype: float64

In [9]:
dataset.dropna(inplace=True)

In [10]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date
0,2018 Tata NEXON,XM 1.2,Manual,"95,230 km",1st Owner,Petrol,UP-16,"₹6,50,000",31 December 2018
1,2017 Renault Kwid,1.0 RXT Opt,Manual,"72,956 km",2nd Owner,Petrol,HR-11,"₹3,19,000",05 March 2019

# changing car name

In [11]:
dataset["car_name"]

0              2018 Tata NEXON
1            2017 Renault Kwid
2       2017 HYUNDAI ELITE I20
3        2019 Mahindra XUV 3OO
4           2020 Hyundai Creta
                ...
894         2021 Renault Kiger
895           2021 Maruti ALTO
896    2020 Maruti New Wagon-R
897             2020 KIA SONET
898          2011 Maruti Swift
Name: car_name, Length: 887, dtype: object

In [12]:
def year(x):
    return x[:x.index(" ")]

In [13]:
dataset["year"] = dataset["car_name"].apply(year)

In [14]:
dataset["year"]

0      2018
1      2017
2      2017
3      2019
4      2020
       ...
894    2021
895    2021
896    2020
897    2020
898    2011
Name: year, Length: 887, dtype: object

In [15]:
def car_name(x):
    return x[x.index(" ")+1:]

In [16]:
dataset["car_name"] = dataset["car_name"].apply(car_name)

In [17]:
dataset["car_name"]

0              Tata NEXON
1            Renault Kwid
2       HYUNDAI ELITE I20
3        Mahindra XUV 3OO
4           Hyundai Creta
              ...
894         Renault Kiger
895           Maruti ALTO
896    Maruti New Wagon-R
897             KIA SONET
898          Maruti Swift
Name: car_name, Length: 887, dtype: object

In [18]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date,year
0,Tata NEXON,XM 1.2,Manual,"95,230 km",1st Owner,Petrol,UP-16,"₹6,50,000",31 December 2018,2018
1,Renault Kwid,1.0 RXT Opt,Manual,"72,956 km",2nd Owner,Petrol,HR-11,"₹3,19,000",05 March 2019,2017

In [19]:
dataset["price"]

0       ₹6,50,000
1       ₹3,19,000
2       ₹5,87,000
3       ₹8,22,000
4      ₹16,74,000
          ...
894     ₹9,90,000
895     ₹4,38,000
896     ₹5,67,000
897    ₹12,71,000
898     ₹2,93,000
Name: price, Length: 887, dtype: object

# Relace , and $

In [20]:
dataset["price"] = dataset["price"].str.replace(",","")

In [21]:
dataset["price"]

0       ₹650000
1       ₹319000
2       ₹587000
3       ₹822000
4      ₹1674000
         ...
894     ₹990000
895     ₹438000
896     ₹567000
897    ₹1271000
898     ₹293000
Name: price, Length: 887, dtype: object

In [22]:
dataset["price"] = dataset["price"].str.replace("₹","")

In [23]:
dataset["price"]

0       650000
1       319000
2       587000
3       822000
4      1674000
        ...
894     990000
895     438000
896     567000
897    1271000
898     293000
Name: price, Length: 887, dtype: object

In [24]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date,year
0,Tata NEXON,XM 1.2,Manual,"95,230 km",1st Owner,Petrol,UP-16,650000,31 December 2018,2018
1,Renault Kwid,1.0 RXT Opt,Manual,"72,956 km",2nd Owner,Petrol,HR-11,319000,05 March 2019,2017

In [25]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 887 entries, 0 to 898
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_name       887 non-null    object
 1   variant        887 non-null    object
 2   transmission   887 non-null    object
 3   km_driven      887 non-null    object
 4   owner_type     887 non-null    object
 5   fuel_type      887 non-null    object
 6   registeration  887 non-null    object
 7   price          887 non-null    object
 8   Date           887 non-null    object
 9   year           887 non-null    object
dtypes: object(10)
memory usage: 76.2+ KB

In [26]:
 dataset['price'] = dataset["price"].astype("float")

In [27]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 887 entries, 0 to 898
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_name       887 non-null    object
 1   variant        887 non-null    object
 2   transmission   887 non-null    object
 3   km_driven      887 non-null    object
 4   owner_type     887 non-null    object
 5   fuel_type      887 non-null    object
 6   registeration  887 non-null    object
 7   price          887 non-null    float64
 8   Date           887 non-null    object
 9   year           887 non-null    object
dtypes: float64(1), object(9)
memory usage: 76.2+ KB

In [28]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date,year
0,Tata NEXON,XM 1.2,Manual,"95,230 km",1st Owner,Petrol,UP-16,650000.0,31 December 2018,2018
1,Renault Kwid,1.0 RXT Opt,Manual,"72,956 km",2nd Owner,Petrol,HR-11,319000.0,05 March 2019,2017

# km_driven replace km

In [29]:
dataset['km_driven'] = dataset['km_driven'].str.replace(",","")
dataset['km_driven'] = dataset['km_driven'].str.replace(" km", "")

In [30]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date,year
0,Tata NEXON,XM 1.2,Manual,95230,1st Owner,Petrol,UP-16,650000.0,31 December 2018,2018
1,Renault Kwid,1.0 RXT Opt,Manual,72956,2nd Owner,Petrol,HR-11,319000.0,05 March 2019,2017

In [31]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 887 entries, 0 to 898
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_name       887 non-null    object
 1   variant        887 non-null    object
 2   transmission   887 non-null    object
 3   km_driven      887 non-null    object
 4   owner_type     887 non-null    object
 5   fuel_type      887 non-null    object
 6   registeration  887 non-null    object
 7   price          887 non-null    float64
 8   Date           887 non-null    object
 9   year           887 non-null    object
dtypes: float64(1), object(9)
memory usage: 76.2+ KB

In [32]:
dataset['km_driven'] = dataset['km_driven'].astype("int")

In [33]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 887 entries, 0 to 898
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_name       887 non-null    object
 1   variant        887 non-null    object
 2   transmission   887 non-null    object
 3   km_driven      887 non-null    int64
 4   owner_type     887 non-null    object
 5   fuel_type      887 non-null    object
 6   registeration  887 non-null    object
 7   price          887 non-null    float64
 8   Date           887 non-null    object
 9   year           887 non-null    object
dtypes: float64(1), int64(1), object(8)
memory usage: 76.2+ KB

# changing date format

In [34]:
dataset['Date'] = pd.to_datetime(dataset['Date'])

In [35]:
dataset.head(2)

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date,year
0,Tata NEXON,XM 1.2,Manual,95230,1st Owner,Petrol,UP-16,650000.0,2018-12-31,2018
1,Renault Kwid,1.0 RXT Opt,Manual,72956,2nd Owner,Petrol,HR-11,319000.0,2019-03-05,2017

In [36]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 887 entries, 0 to 898
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_name       887 non-null    object
 1   variant        887 non-null    object
 2   transmission   887 non-null    object
 3   km_driven      887 non-null    int64
 4   owner_type     887 non-null    object
 5   fuel_type      887 non-null    object
 6   registeration  887 non-null    object
 7   price          887 non-null    float64
 8   Date           887 non-null    datetime64[ns]
 9   year           887 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(7)
memory usage: 76.2+ KB

In [37]:
dataset['year'] = pd.to_datetime(dataset['year'])

In [38]:
dataset.head()

,car_name,variant,transmission,km_driven,owner_type,fuel_type,registeration,price,Date,year
0,Tata NEXON,XM 1.2,Manual,95230,1st Owner,Petrol,UP-16,650000.0,2018-12-31,2018-01-01
1,Renault Kwid,1.0 RXT Opt,Manual,72956,2nd Owner,Petrol,HR-11,319000.0,2019-03-05,2017-01-01
2,HYUNDAI ELITE I20,ASTA 1.2 (O),Manual,50636,2nd Owner,Petrol,DL-7C,587000.0,2024-08-08,2017-01-01
3,Mahindra XUV 3OO,W8(O),Manual,86652,1st Owner,Diesel,DL-12,822000.0,2025-01-25,2019-01-01
4,Hyundai Creta,1.5 SX (O) AT,Automatic,20235,1st Owner,Petrol,DL-9C,1674000.0,2020-01-14,2020-01-01

In [44]:
dataset.to_csv('D:\DA DS\data cleaning datasets\cars_cleaned_data.csv')